Revit 2026 API

# PointCloudColorSettingsAssign Method

---

Assigns values of the source settings to this object.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Assign(
	PointCloudColorSettings other
)
```
```vb
Public Sub Assign (
	other As PointCloudColorSettings
)
```
```cpp
public:
void Assign(
	PointCloudColorSettings^ other
)
```
```fsharp
member Assign :
        other : PointCloudColorSettings -> unit
```

#### Parameters

other PointCloudColorSettings
     The source settings.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PointCloudColorSettings Class

Autodesk.Revit.DB.PointClouds Namespace